Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [3]:
data = [4,8,15,16,23,42]
series = pd.Series(data)

In [5]:
type(series)

pandas.core.series.Series

In [6]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
var = list(range(10))

In [8]:
type(var)

list

In [9]:
series =pd.Series(var)

In [10]:
print(series)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Name      Age        Gender 
Alice     25         female
Bob       30         male
claire    27         female

Then, print the DataFrame.

In [11]:
data = {"name":["Alice","Bob","Claire"],
        "Age":[25,30,27],
        "Gender":["female","male","female"]
}

In [12]:
dataframe = pd.DataFrame(data)

In [13]:
type(dataframe)

pandas.core.frame.DataFrame

In [14]:
dataframe

     name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Answer == DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). It can be thought of as a dictionary of Series objects, where each Series is a column of the DataFrame.

On the other hand, a Series is a one-dimensional array-like object containing a sequence of values and an associated array of data labels, called its index. A Series can hold data of any type (integer, string, float, etc.).

EXAMPLE ==

In [16]:
# creating series 
data = [1,2,3,4,5]
series= pd.Series(data)

In [17]:
#creating second series
data1 = ["divyanshu" , "pwskills","sudh","sir","datascience"]
series1=pd.Series(data1)

In [18]:
print (series),print(series1)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0      divyanshu
1       pwskills
2           sudh
3            sir
4    datascience
dtype: object

(None, None)

In [19]:
#creating a dataframe
data = { "series":[1,2,3,4,5],
        "series1": ["divyanshu" , "pwskills","sudh","sir","datascience"]
       }
data_frame = pd.DataFrame(data)

In [20]:
data_frame

   series      series1
0       1    divyanshu
1       2     pwskills
2       3         sudh
3       4          sir
4       5  datascience

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Answer = Pandas is a powerful data manipulation library in Python. Here are some common functions I can use to manipulate data in a Pandas DataFrame

1.head() and .tail(): Display the first or last n rows of the DataFrame.

Example: df.head(5) to see the first 5 rows of the DataFrame.

2.describe(): Generate descriptive statistics.

Example: df.describe() to get a summary of the data including mean, median, standard deviation, etc.

3.drop(): Remove rows or columns by specifying label names and axis.

Example: df.drop('column_name', axis=1) to drop a column named "column_name".

In [22]:
#creating a dataframe
data = { "series":[1,2,3,4,5,6,7,8],
        "series1": ["divyanshu" , "pwskills","sudh","sir","datascience","batch","abc","xyz"]
       }
df= pd.DataFrame(data)

In [23]:
df.head()

   series      series1
0       1    divyanshu
1       2     pwskills
2       3         sudh
3       4          sir
4       5  datascience

In [24]:
df.tail()

   series      series1
3       4          sir
4       5  datascience
5       6        batch
6       7          abc
7       8          xyz

In [26]:
df.describe()

        series
count  8.00000
mean   4.50000
std    2.44949
min    1.00000
25%    2.75000
50%    4.50000
75%    6.25000
max    8.00000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Answer== Both Series and DataFrame are mutable, meaning I can modify their contents after they have been created. However, Panel, which was used for 3-dimensional data, has been deprecated and removed from Pandas starting from version 1.0.0.

1.Series: Mutable
2.DataFrame: Mutable
3.Panel: Deprecated (was mutable before deprecation)

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [27]:
#creating multiple Series
data = [1,2,3,4,5]
series= pd.Series(data)

data1 = ["divyanshu" , "pwskills","sudh","sir","datascience"]
series1=pd.Series(data1)

In [29]:
#creating DataFrame using series ,series1
data_frame = { "Series": series,
              "Series1": series1,
}
df = pd.DataFrame(data_frame)

In [30]:
df

   Series      Series1
0       1    divyanshu
1       2     pwskills
2       3         sudh
3       4          sir
4       5  datascience